from prettytable import PrettyTable

dictionary_spinners = {
    1.8: 3,
    1.6: 4,
    1.422: 5,
    1.2638: 6,
    1.1232: 7,
    0.9983: 8,
    0.8872: 9,
    0.7875: 10,
    0.6993: 11,
    0.621: 12,
    0.5514: 13,
    0.4896: 14,
    0.446: 15,
    0.4063: 16,
    0.3701: 17,
    0.3371: 18,
    0.3075: 19,
    0.2795: 20,
    0.26: 21
}

first_param_table = PrettyTable(["Номер счета", "Марка", "Дата выпуска", "Длина кабеля, км", "Волочение, мм",
                                 "На волочение, мм", "Диаметр проволоки (волочение) плюсовой, мм"])

second_param_table = PrettyTable(["Длина кабеля, км", "Количество жил", "Кол-во стренг", "Всего проволочек в 1 стренге",
                                  "Диаметр проволоки на волочении, мм",
                                  "Количество жил плюсовой", "Кол-во стренг плюсовой",
                                  "Всего проволочек в1 стренге плюсовой", "Диаметр проволоки (волочение) плюсовой, мм"])

d_mult = 2.08
